import { Inject, Injectable } from "@nestjs/common";
import { ChatOllama } from "@langchain/ollama";
import { StateType } from "../graph/state";

@Injectable()
export class ReporterAgent {
  constructor(@Inject("LLM_MODEL") private readonly model: ChatOllama) {}

  async execute(state: StateType): Promise<Partial<StateType>> {
    console.info("📝 Шаг: Reporter — формирование отчета...", state);

      const context = state.research
          .flatMap((r: any) => {
              // Если r.results существует — берем его, иначе пробуем сам r как массив или объект
              const items = r.results || (Array.isArray(r) ? r : [r]);

              return items.map((item: any) => {

                  // Извлекаем контент, обращая внимание на структуру Tavily
                  const text = item.content || (typeof item === 'string' ? item : JSON.stringify(item));
                  const result =  `Источник: ${item.title || 'Без названия'}\nТекст: ${text}`;
                  return result
              });
          })
          .join('\n---\n')
          .slice(0, 15000);
    console.info('context', context)
      const prompt = `
      Ты — технический аналитик. Твоя задача: превратить массив данных в структурированные тезисы.

ПРАВИЛА ОТВЕТА (JSON):
1. Весь ответ должен быть СТРОГИМ JSON-объектом.
2. Внутри строковых значений используй только экранированные кавычки (\\") и символы переноса строки (\\\\n).
3. Пиши максимально СУХИМИ ФАКТАМИ. Избегай вступлений и вежливых фраз.

СТРУКТУРА:
{
  "summary": "Суть исследования одним предложением.",
  "sections": [
    {
      "title": "Заголовок (макс. 3 слова)",
      "points": [
        "Тезис 1 (коротко)",
        "Тезис 2 (коротко)",
        "Тезис 3 (коротко)"
      ]
    }
  ],
  "conclusion": "Главный вывод."
}

ОГРАНИЧЕНИЯ:
- Максимум 3 раздела (sections).
- Ровно 3 тезиса (points) в каждом разделе.
      `
   //  const prompt = `Ты — профессиональный технический писатель.
   //  На основе собранных данных по теме "${state.task}", напиши подробный аналитический отчет.
   //
   //  ДАННЫЕ ИЗ СЕТИ:
   //  ${context}
   //
   // ИНСТРУКЦИЯ:
   //  1. Пиши на русском языке.
   //  2. Используй Markdown: заголовки и списки.
   //  3. Если данных недостаточно — напиши только то, что нашел.
   //  4. НЕ ПИШИ вступление ("Конечно, вот ваш отчет"). Сразу начинай с заголовка.`;

    const response = await this.model.invoke(prompt);
      console.info(`response`, response);
      const reportText = response.content.toString();
      console.info(`✅ Отчет готов (${reportText.length} симв.)`, { reportText });
    return {
      report: reportText,
    };
  }
}
